In [3]:
import pandas as pd
import os
from sqlalchemy import create_engine
import time
import datetime

In [4]:
thor_data = '../Resources/THOR_WWII_DATA_CLEANED.csv'

In [5]:
thor_df = pd.read_csv(thor_data, encoding='latin-1')
thor_df.columns

Index(['WWII_ID', 'MSNDATE', 'THEATER', 'NAF', 'COUNTRY_FLYING_MISSION',
       'TGT_COUNTRY', 'TGT_LOCATION', 'LATITUDE', 'LONGITUDE', 'AIRCRAFT_NAME',
       'MAX', 'MIN'],
      dtype='object')

In [6]:
thor_df = thor_df[['MSNDATE', 'THEATER', 'NAF', 'COUNTRY_FLYING_MISSION',
       'TGT_COUNTRY', 'TGT_LOCATION', 'LATITUDE', 'LONGITUDE', 'AIRCRAFT_NAME',
       'MAX', 'MIN']].copy()
thor_df
thor_df = thor_df.sort_values(by='MSNDATE').copy()

In [7]:
thor_df = thor_df.dropna(how='any').copy()
thor_df = thor_df.rename_axis('ID').copy()
thor_df = thor_df.head(5000)
thor_df

,MSNDATE,THEATER,NAF,COUNTRY_FLYING_MISSION,TGT_COUNTRY,TGT_LOCATION,LATITUDE,LONGITUDE,AIRCRAFT_NAME,MAX,MIN
ID,,,,,,,,,,,
10706,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,KIEL,54.330000,10.150000,HAMPDEN,88.0,78.0
10802,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,86.0,74.0
10803,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,85.0,72.0
10804,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,82.0,70.0
10805,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,85.0,68.0
...,...,...,...,...,...,...,...,...,...,...,...
113587,10/12/44,PTO,5 AF,USA,CELEBES ISLANDS,LIANG,-3.516667,128.300000,A20,92.0,68.0
113934,10/12/44,PTO,5 AF,USA,CELEBES ISLANDS,AMBESIA,0.516667,120.600000,B24,77.0,51.0
113935,10/12/44,PTO,7 AF,USA,MARIANAS ISLANDS,PAGAN ISLAND,18.133333,145.783333,B24,73.0,58.0
113936,10/12/44,PTO,13 AF,USA,CELEBES ISLANDS,NAMLEA,-3.266667,127.100000,B25,79.0,52.0
113931,10/12/44,PTO,5 AF,USA,CELEBES ISLANDS,AMBESIA,0.516667,120.600000,B24,86.0,66.0

In [9]:
# inserting df into db table
engine = create_engine('sqlite:///../wwii.db', echo=False)
thor_df.to_sql('wwii_data', con=engine,if_exists='append')